<?php

namespace Vantoozz\Morphy;

class Morphy
{

    private $morphy;

    public function __construct()
    {
        try {
            $this->morphy = new \phpMorphy(__DIR__ . '/../../../vendor/phpmorphy/dicts', 'ru_RU', array('storage' => PHPMORPHY_STORAGE_FILE));
        } catch (phpMorphy_Exception $e) {
            $this->morphy = null;
        }
    }


    public function normalize($text)
    {
        $normal_text = array();

        if (!$this->morphy) {
            return $normal_text;
        }

        $text = trim($text);
        $text = preg_replace('/[^A-Za-zА-Яа-яЁё]/u', ' ', $text);
        $text = preg_replace('/\s+/', ' ', $text);
        $text = mb_strtoupper($text, 'UTF-8');
        $text = trim($text);
        $text = explode(' ', $text);

        if (empty($text)) {
            return $normal_text;
        }

        $normal_text = array();

        $result = $this->morphy->lemmatize($text);

        if (is_array($result)) {
            $stopwords = $this->stopwords();
            foreach ($result as $word) {
                if (is_array($word)) {
                    foreach ($word as $form) {
                        if(!in_array($form, $stopwords)){
                            $normal_text[$form] = $form;
                        }
                    }
                }
            }
        }

        return $normal_text;
    }


    public function stopwords(){
        return array(
            'А',
            'Б',
            'В',
            'Г',
            'Д',
            'Е',
            'Ё',
            'Ж',
            'З',
            'И',
            'Й',
            'К',
            'Л',
            'М',
            'Н',
            'О',
            'П',
            'Р',
            'С',
            'Т',
            'У',
            'Ф',
            'Х',
            'Ц',
            'Ч',
            'Ш',
            'Щ',
            'Ъ',
            'Ы',
            'Ь',
            'Э',
            'Ю',
            'Я',
            'БЕЗ',
            'БОЛЕЕ',
            'БЫ',
            'БЫЛ',
            'БЫЛА',
            'БЫЛИ',
            'БЫЛО',
            'БЫТЬ',
            'В',
            'ВАМ',
            'ВАС',
            'ВЕСЬ',
            'ВО',
            'ВОТ',
            'ВСЕ',
            'ВСЕГО',
            'ВСЕХ',
            'ВЫ',
            'ГДЕ',
            'ДА',
            'ДАЖЕ',
            'ДЛЯ',
            'ДО',
            'ЕГО',
            'ЕЕ',
            'ЕСЛИ',
            'ЕСТЬ',
            'ЕЩЕ',
            'ЖЕ',
            'ЗА',
            'ЗДЕСЬ',
            'И',
            'ИЗ',
            'ИЛИ',
            'ИМ',
            'ИХ',
            'К',
            'КАК',
            'КО',
            'КОГДА',
            'КТО',
            'ЛИ',
            'ЛИБО',
            'МНЕ',
            'МОЖЕТ',
            'МЫ',
            'НА',
            'НАДО',
            'НАШ',
            'НЕ',
            'НЕГО',
            'НЕЕ',
            'НЕТ',
            'НИ',
            'НИХ',
            'НО',
            'НУ',
            'О',
            'ОБ',
            'ОДНАКО',
            'ОН',
            'ОНА',
            'ОНИ',
            'ОНО',
            'ОТ',
            'ОЧЕНЬ',
            'ПО',
            'ПОД',
            'ПРИ',
            'С',
            'СО',
            'ТАК',
            'ТАКЖЕ',
            'ТАКОЙ',
            'ТАМ',
            'ТЕ',
            'ТЕМ',
            'ТО',
            'ТОГО',
            'ТОЖЕ',
            'ТОЙ',
            'ТОЛЬКО',
            'ТОМ',
            'ТЫ',
            'У',
            'УЖЕ',
            'ХОТЯ',
            'ЧЕГО',
            'ЧЕЙ',
            'ЧЕМ',
            'ЧТО',
            'ЧТОБЫ',
            'ЧЬЕ',
            'ЧЬЯ',
            'ЭТА',
            'ЭТИ',
            'ЭТО',
            'ЯА',
            'БЕЗ',
            'БОЛЕЕ',
            'БЫ',
            'БЫЛ',
            'БЫЛА',
            'БЫЛИ',
            'БЫЛО',
            'БЫТЬ',
            'В',
            'ВАМ',
            'ВАС',
            'ВАШ',
            'ВЕДЬ',
            'ВЕСЬ',
            'ВО',
            'ВОТ',
            'ВСЕ',
            'ВСЕГО',
            'ВСЕХ',
            'ВЫ',
            'ГДЕ',
            'ДА',
            'ДАЖЕ',
            'ДЛИТЬ',
            'ДЛЯ',
            'ДО',
            'ЕГО',
            'ЕЕ',
            'ЕМУ',
            'ЕСЛИ',
            'ЕСТЬ',
            'ЕЩЕ',
            'ЕЙ',
            'ЖЕ',
            'ЗА',
            'ЗДЕСЬ',
            'И',
            'ИЗ',
            'ИЛИ',
            'ИМ',
            'ИМИ',
            'ИХ',
            'К',
            'КАК',
            'КО',
            'КОГДА',
            'КОТОРЫЙ',
            'КТО',
            'ЛИ',
            'ЛИБО',
            'МНЕ',
            'МОЖЕТ',
            'МОЖНО',
            'МЫ',
            'НА',
            'НАДО',
            'НАШ',
            'НЕ',
            'НЕГО',
            'НЕЕ',
            'НЕТ',
            'НИ',
            'НИХ',
            'НО',
            'НУ',
            'О',
            'ОБ',
            'ОДНАКО',
            'ОН',
            'ОНА',
            'ОНИ',
            'ОНО',
            'ОТ',
            'ОЧЕНЬ',
            'ПО',
            'ПОД',
            'ПОКА',
            'ПРИ',
            'РУБ',
            'С',
            'САМЫЙ',
            'СВОЕЙ',
            'СВОЕ',
            'СВОЁ',
            'СВОЙ',
            'СВОИМ',
            'СВОЮ',
            'СВОЯ',
            'СО',
            'ТАК',
            'ТАКЖЕ',
            'ТАКОЙ',
            'ТАМ',
            'ТЕ',
            'ТЕМ',
            'ТИП',
            'ТО',
            'ТОТ',
            'ТОГО',
            'ТОЖЕ',
            'ТОЙ',
            'ТОЛЬКО',
            'ТОМ',
            'ТЫ',
            'У',
            'УЖЕ',
            'ХОТЯ',
            'ЧЕГО',
            'ЧЕЙ',
            'ЧЕМ',
            'ЧТО',
            'ЧТОБЫ',
            'ЧЬЕ',
            'ЧЬЯ',
            'ЭТА',
            'ЭТОТ',
            'ЭТИ',
            'ЭТИМ',
            'ЭТО',
            'ЭТОТ',
            'Я',
            'ИЗА',
        );
    }

}
